https://github.com/okovtun/BD_212.git
https://www.youtube.com/watch?v=ZJbKZvQWSYE&list=PLeqyOOqxeiINMS3J8UDR0sWefK7Y0uEiH

TODO:
	//1)
   int i = 3;
   i = ++i + ++i;
   cout << i << endl;	//что будет выведено на экран

   //2)
   int i = 3;
   i = ++i + 1 + ++i * 2;
   cout << i << endl;	//что будет выведено на экран

   //3)
   int i = 3;
   i = ++i + 1 + ++i *= 2;
   cout << i << endl;	//что будет выведено на экран

   //4)
   int i = 3;
   i += ++i + 1 + ++i *= 2;
   cout << i << endl;	//что будет выведено на экран

   //5)
   int i = 3;
   i *= ++i + 1 + ++i += 2;
   cout << i << endl;	//что будет выведено на экран

1. Написать программу для тестирования на 5 вопросов, по четыре варианта ответов,
   только один из четырех ответов правильный.
   В конце программа должна выдать количество правильных ответов.
2. Написать программу "Калькулятор", которая вычисляет выражения вида:
	2 + 3
	2 + 3 = 5;
   Калькулятор должен выполнять все арифметические операции +, -, *, /

DONE:
https://www.youtube.com/watch?v=4NYC-VU-svE&t=3s
Выучить теорию!

DONE:
Решить все задачи из файла: https://github.com/okovtun/BD_212/blob/master/DataTypes/VariablesTask.pdf

DONE:
Выучить теорию!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
http://www.softelectro.ru/ieee754_en.html
http://www.softelectro.ru/teoriy.html

DONE:
1. Выучить теорию!
2. Вывести в окно консоли стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли, 
   и его куплеты должны быть разделены пустой строкой.

DONE:
1. Скачать программу AnyDesk: https://anydesk.com/en;
2. Зарегистрировать на сайте https://windscribe.com, скачать и установить VPN-клиент;

Hardware-PC